{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[EOS]": 2,
      "TIME_DELTA=4": 3,
      "TIME_DELTA=2": 4,
      "BAR_END": 5,
      "BAR_START": 6,
      "TRACK_END": 7,
      "TRACK_START": 8,
      "NOTE_OFF=67": 9,
      "NOTE_ON=67": 10,
      "NOTE_OFF=65": 11,
      "NOTE_ON=65": 12,
      "NOTE_OFF=62": 13,
      "NOTE_ON=62": 14,
      "NOTE_OFF=60": 15,
      "NOTE_ON=60": 16,
      "TIME_DELTA=8": 17,
      "NOTE_OFF=64": 18,
      "NOTE_ON=64": 19,
      "NOTE_OFF=63": 20,
      "NOTE_ON=63": 21,
      "NOTE_OFF=66": 22,
      "NOTE_ON=66": 23,
      "NOTE_OFF=69": 24,
      "NOTE_ON=69": 25,
      "NOTE_OFF=68": 26,
      "NOTE_ON=68": 27,
      "NOTE_OFF=61": 28,
      "NOTE_ON=61": 29,
      "NOTE_OFF=58": 30,
      "NOTE_ON=58": 31,
      "NOTE_OFF=55": 32,
      "NOTE_ON=55": 33,
      "NOTE_OFF=70": 34,
      "NOTE_ON=70": 35,
      "NOTE_OFF=59": 36,
      "NOTE_ON=59": 37,
      "NOTE_OFF=57": 38,
      "NOTE_ON=57": 39,
      "NOTE_OFF=56": 40,
      "NOTE_ON=56": 41,
      "NOTE_OFF=53": 42,
      "NOTE_ON=53": 43,
      "NOTE_OFF=71": 44,
      "NOTE_ON=71": 45,
      "NOTE_OFF=72": 46,
      "NOTE_ON=72": 47,
      "NOTE_OFF=54": 48,
      "NOTE_ON=54": 49,
      "NOTE_OFF=52": 50,
      "NOTE_ON=52": 51,
      "NOTE_OFF=50": 52,
      "NOTE_ON=50": 53,
      "NOTE_OFF=51": 54,
      "NOTE_ON=51": 55,
      "NOTE_OFF=48": 56,
      "NOTE_ON=48": 57,
      "NOTE_OFF=73": 58,
      "NOTE_ON=73": 59,
      "NOTE_OFF=74": 60,
      "NOTE_ON=74": 61,
      "NOTE_OFF=49": 62,
      "NOTE_ON=49": 63,
      "NOTE_OFF=47": 64,
      "NOTE_ON=47": 65,
      "NOTE_OFF=75": 66,
      "NOTE_ON=75": 67,
      "NOTE_OFF=46": 68,
      "NOTE_ON=46": 69,
      "GENRE=JSFAKES": 70,
      "INST=0": 71,
      "INST=24": 72,
      "INST=32": 73,
      "INST=48": 74,
      "PIECE_END": 75,
      "PIECE_START": 76,
      "STYLE=JSFAKES": 77,
      "TIME_DELTA=1": 78,
      "NOTE_OFF=45": 79,
      "NOTE_ON=45": 80,
      "NOTE_OFF=76": 81,
      "NOTE_ON=76": 82,
      "TIME_DELTA=6": 83,
      "NOTE_OFF=44": 84,
      "NOTE_ON=44": 85,
      "TIME_DELTA=12": 86,
      "NOTE_OFF=43": 87,
      "NOTE_ON=43": 88,
      "NOTE_OFF=77": 89,
      "NOTE_ON=77": 90,
      "NOTE_OFF=78": 91,
      "NOTE_ON=78": 92,
      "NOTE_OFF=41": 93,
      "NOTE_ON=41": 94,
      "NOTE_OFF=42": 95,
      "NOTE_ON=42": 96,
      "NOTE_OFF=79": 97,
      "NOTE_ON=79": 98,
      "NOTE_OFF=40": 99,
      "NOTE_ON=40": 100,
      "TIME_DELTA=16": 101,
      "NOTE_OFF=39": 102,
      "NOTE_ON=39": 103,
      "NOTE_OFF=80": 104,
      "NOTE_ON=80": 105,
      "TIME_DELTA=3": 106,
      "NOTE_OFF=38": 107,
      "NOTE_ON=38": 108,
      "NOTE_OFF=37": 109,
      "NOTE_ON=37": 110,
      "NOTE_OFF=36": 111,
      "NOTE_ON=36": 112,
      "NOTE_OFF=81": 113,
      "NOTE_ON=81": 114,
      "TIME_DELTA=7": 115,
      "TIME_DELTA=10": 116
    },
    "unk_token": "[UNK]"
  }
}